"use strict";
// ===================Conditions============================
const total = 100;
let ordered;
// ===================Solution==============================
// ====================condition-1==========================
ordered = 20;
const confirmed = "Заказ оформлен, с вами свяжется менеджер"
const cancelled  = "На складе недостаточно твоаров!"

// ===================Solution 1 ==============================
let cases = (total > ordered) ? confirmed : cancelled;
console.log(cases);
// ===================Solution 2 ==============================
// if (total > ordered) {
//   console.log(confirmed);
// } else {
//   console.log(cancelled);
// }

// ====================condition-2==========================
ordered = 80;
cases = (total > ordered) ? confirmed : cancelled;
console.log(cases);

// ====================condition-3==========================
ordered = 130;
cases = (total > ordered) ? confirmed : cancelled;
console.log(cases);

// Напиши скрипт проверки количества товаров на складе.
//  Есть переменные total (количество товаров на складе)
// и ordered (единиц товара в заказе).

// Сравни эти значения и по результатам выведи:

// Если в заказе указано число, превышающее количество
// товаров на складе, то выведи сообщение "На складе недостаточно твоаров!".
// В другом случае выводи сообщение "Заказ оформлен, с
//  вами свяжется менеджер".
// Проверь работоспособность кода с разными значениями
// переменной ordered, например 20, 80 и 130.
